{"chunk_id": 0, "chunk": "General research interests topics are Wireless Communication, Cooperative Cognitive Communication, Wireless Sensor Networks (WSNs), \nand Internet of Things (IoT). Currently, I am involved with secure wireless communication for the future generation networks using physical \nlayer security techniques.\n\nDoctoral Thesis \n\nResearch Topic: Physical Layer Security for V2X-enabled Cooperative and Cognitiv"}
{"chunk_id": 1, "chunk": "\n\nDoctoral Thesis \n\nResearch Topic: Physical Layer Security for V2X-enabled Cooperative and Cognitive Relay Networks.\n\nSupervisor: Dr. Suneel Yadav, Assistant Professor, IIIT Allahabad.\n\nBrief Overview: Cooperative vehicular relaying networks (CVRNs) support various key intelligent transportation \napplication services such as traffic management, payment services, infotainment etc. These CVRNs are "}
{"chunk_id": 2, "chunk": "pplication services such as traffic management, payment services, infotainment etc. These CVRNs are paving the \nway for the development of a new paradigm called Internet of Vehicles (IoV). Such networks will require the information exchange \nto occur between the vehicles, infrastructure, users, and the Internet mostly over an open and vulnerable wireless medium. \nThus securing the transmissions at"}
{"chunk_id": 3, "chunk": "the Internet mostly over an open and vulnerable wireless medium. \nThus securing the transmissions at the physical layer becomes essential. The objective in this work is to investigate the \npotential benefits of physical layer security (PHY-security) for providing information security in CVRNs under cognitive and non-cognitive scenarios.\n\nM.Tech. Thesis\n\nResearch Topic: Intra-Cluster Community Mech"}
{"chunk_id": 4, "chunk": "cognitive and non-cognitive scenarios.\n\nM.Tech. Thesis\n\nResearch Topic: Intra-Cluster Community Mechanism for Energy Efficiency and Data Resolution in Wireless Sensor Network.\n\nSupervisor: Dr. K.K. Pattanaik, Associate Professor, ABV-IIITM Gwalior.\n\nBrief Overview: Clustering scheme is effective in large scale densely deployed Wireless Sensor Networks (WSN). \nPerforming data aggregation at cluster"}
{"chunk_id": 5, "chunk": "large scale densely deployed Wireless Sensor Networks (WSN). \nPerforming data aggregation at cluster head (CH) or compressing the data traffic originating from spatially correlated nodes \ndoes not resolve the redundant traffic within the cluster and causes energy wastage. Selecting one node at a time among the \ncorrelated ones affects the data resolution. The novelty of this work lied in eliminati"}
{"chunk_id": 6, "chunk": "e among the \ncorrelated ones affects the data resolution. The novelty of this work lied in eliminating the redundant transmissions \nthrough designing a novel community of spatially correlated nodes within the cluster and then using average consensus \nmechanism for an efficient data aggregation. The above mechanism resulted in considerable reduction of redundant traffic, energy consumption, channel"}
{"chunk_id": 7, "chunk": "above mechanism resulted in considerable reduction of redundant traffic, energy consumption, channel \ncontention and better GTS slot assignment while preserving data resolution. The above system was verified through both mathematical and \nsimulation in OPNET Network simulator."}
